# parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 1, Conv_ScalableLinear, [512, [2,2,2,2,2,2,2,2,8,8,16,16], 12, [5,5,5,5,5,5,5,5,1,1,1,1], [2,2,2,2,2,2,2,2,1,1,1,1], None , 1, False, True]], # Next Compression
   [-1, 1, Multi_Compressor, [[2,2,2,2,2,2,2,2,8,8,16,16], [2,2,2,2,2,2,2,2,8,8,16,16], 12]],
   [-1, 1, ConvInv_ScalableLinear, [[2,2,2,2,2,2,2,2,8,8,16,16], 512, 12, [5,5,5,5,5,5,5,5,1,1,1,1], [2,2,2,2,2,2,2,2,1,1,1,1], None , 1, True, True]], 
   ]
   
head:
  
  [
  ]