# parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  #- [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   
   ## Compression for Base
   [8, 1, Conv, [32, 1, 1, None , 1, False]],  # Next compression
   [-1, 1, Quantize_Hyperprior, [32,32]], # compression
   [-1, 1, Conv, [1024, 1, 1]], #11
   
   ## Compression for e1
   [10, 1, TransposeConv, [32, 3, 2]],  # Hyperprior from lower layer
   [6, 1, Conv, [128, 1, 1, None , 1, False]],  # Next compression
   [[-1, 12], 1, Quantize_Hyperprior_Layered, [128,128,32]], # compression
   [-1, 1, Conv, [512, 1, 1]],  #15
   
   [11, 3, C3, [1024, False]],  # 16
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 15], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 20

   [-1, 1, Conv, [256, 1, 1]],
   #[-1, 1, nn.Upsample, [None, 2, 'nearest']],
   #[[-1, 4], 1, Concat, [1]],  # cat backbone P3
   #[-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   #[-1, 1, Conv, [256, 3, 2]],
   #[[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # (P4/16-medium)
   [-1, 1, Conv2, [42, 1]], #23

   [22, 1, Conv, [512, 3, 2]],
   [[-1, 17], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # (P5/32-large)
   [-1, 1, Conv2, [42, 1]], #28

   [[23, 27], 1, Detect_wo_conv, [nc, anchors, [23,27]]],  # Detect(P3, P4, P5)
  ]